# FamProfileUsage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamProfileUsage Property
ParameterTypeId Class See Also
---
"Profile Usage"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamProfileUsage { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamProfileUsage As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamProfileUsage {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace